***GroupBy_Function***

***Guide to Summarizing and Aggregating Data in Python***
---

*** Applying functions to GroupBy Groups

    Aggregation
    Transformation
    Filteration
    Applying our own function ***
    
##https://www.w3resource.com/pandas/series/series-apply.php

In [1]:
import pandas as pd
import numpy as np

In [4]:
dataset = pd.read_csv('train_bm.csv')
dataset.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [18]:
dataset.groupby('Outlet_Location_Type').count()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Type,Item_Outlet_Sales
Outlet_Location_Type,,,,,,,,,,,
Tier 1,2388,1860,2388,2388,2388,2388,2388,2388,2388,2388,2388
Tier 2,2785,2785,2785,2785,2785,2785,2785,2785,930,2785,2785
Tier 3,3350,2415,3350,3350,3350,3350,3350,3350,2795,3350,3350

In [15]:
dataset.groupby('Outlet_Location_Type')['Item_Outlet_Sales'].count()

Outlet_Location_Type
Tier 1    2388
Tier 2    2785
Tier 3    3350
Name: Item_Outlet_Sales, dtype: int64

# The Split-Apply-Combine Strategy

In [19]:
data = {'Gender' :['m','f','f','m','f','m','m'], 'Height' : [172,171,169,173,170,175,178]}
df = pd.DataFrame(data)
df

  Gender  Height
0      m     172
1      f     171
2      f     169
3      m     173
4      f     170
5      m     175
6      m     178

In [31]:
#One_way_of_doing
f_filter = df[df['Gender'] == 'f']
f_filter

  Gender  Height
1      f     171
2      f     169
4      f     170

In [25]:
##Other_way_of_doing
m_filter = df['Gender'] == 'm'
df[m_filter]

  Gender  Height
0      m     172
3      m     173
5      m     175
6      m     178

In [37]:
f_avg = f_filter.Height.mean()

m_avg = df[m_filter]['Height'].mean()

print(f_avg,m_avg)

170.0 174.5

In [36]:
df_output = {'Gender':['f','m'],'Height':[f_avg,m_avg]}
df_output = pd.DataFrame(df_output)
df_output

  Gender  Height
0      f   170.0
1      m   174.5

In [42]:
df_output.groupby('Gender').mean()

        Height
Gender
f        170.0
m        174.5

In [62]:
obj = dataset.groupby('Outlet_Location_Type')
obj
#obj.groups

# iterate over all of the groups:

In [66]:
for name,group in obj:
    print(name,'contains',group.shape[0],'rows')

Tier 1 contains 2388 rows
Tier 2 contains 2785 rows
Tier 3 contains 3350 rows

In [50]:
obb = dataset.groupby('Outlet_Identifier')
obb

In [58]:
for name,froup in obb:
    print(name, 'conatins', froup.shape[0],'rows')

OUT010 conatins 555 rows
OUT013 conatins 932 rows
OUT017 conatins 926 rows
OUT018 conatins 928 rows
OUT019 conatins 528 rows
OUT027 conatins 935 rows
OUT035 conatins 930 rows
OUT045 conatins 929 rows
OUT046 conatins 930 rows
OUT049 conatins 930 rows

In [70]:
obj.get_group('Tier 1')

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
10,FDY07,11.80,Low Fat,0.000000,Fruits and Vegetables,45.5402,OUT049,1999,Medium,Tier 1,Supermarket Type1,1516.0266
11,FDA03,18.50,Regular,0.045464,Dairy,144.1102,OUT046,1997,Small,Tier 1,Supermarket Type1,2187.1530
12,FDX32,15.10,Regular,0.100014,Fruits and Vegetables,145.4786,OUT049,1999,Medium,Tier 1,Supermarket Type1,1589.2646
...,...,...,...,...,...,...,...,...,...,...,...,...
8480,FDQ58,NaN,Low Fat,0.000000,Snack Foods,154.5340,OUT019,1985,Small,Tier 1,Grocery Store,459.4020
8490,FDU44,NaN,Regular,0.102296,Fruits and Vegetables,162.3552,OUT019,1985,Small,Tier 1,Grocery Store,487.3656
8492,FDT34,9.30,Low Fat,0.174350,Snack Foods,104.4964,OUT046,1997,Small,Tier 1,Supermarket Type1,2419.5172
8517,FDF53,20.75,reg,0.083607,Frozen Foods,178.8318,OUT046,1997,Small,Tier 1,Supermarket Type1,3608.6360
8522,DRG01,14.80,Low Fat,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [71]:
obb.get_group('OUT013')

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
4,NCD19,8.930,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
6,FDO10,13.650,Regular,0.012741,Snack Foods,57.6588,OUT013,1987,High,Tier 3,Supermarket Type1,343.5528
14,FDF32,16.350,Low Fat,0.068024,Fruits and Vegetables,196.4426,OUT013,1987,High,Tier 3,Supermarket Type1,1977.4260
20,FDN22,18.850,Regular,0.138190,Snack Foods,250.8724,OUT013,1987,High,Tier 3,Supermarket Type1,3775.0860
27,DRJ59,11.650,low fat,0.019356,Hard Drinks,39.1164,OUT013,1987,High,Tier 3,Supermarket Type1,308.9312
...,...,...,...,...,...,...,...,...,...,...,...,...
8462,FDQ31,5.785,Regular,0.053802,Fruits and Vegetables,85.9856,OUT013,1987,High,Tier 3,Supermarket Type1,1494.0552
8466,FDJ32,10.695,Low Fat,0.057744,Fruits and Vegetables,61.2536,OUT013,1987,High,Tier 3,Supermarket Type1,673.7896
8484,DRJ49,6.865,Low Fat,0.000000,Soft Drinks,129.9652,OUT013,1987,High,Tier 3,Supermarket Type1,2324.9736
8512,FDR26,20.700,Low Fat,0.042801,Dairy,178.3028,OUT013,1987,High,Tier 3,Supermarket Type1,2479.4392
8518,FDF22,6.865,Low Fat,0.056783,Snack Foods,214.5218,OUT013,1987,High,Tier 3,Supermarket Type1,2778.3834

# Applying Functions to GroupBy Groups

In [72]:
#list is passed
dataset.groupby('Outlet_Location_Type').agg([np.mean,np.median])

                     Item_Weight         Item_Visibility            \
                            mean  median            mean    median
Outlet_Location_Type
Tier 1                 12.892124  12.625        0.071205  0.056450
Tier 2                 12.768628  12.500        0.061038  0.051766
Tier 3                 12.933745  12.650        0.066751  0.053906

                        Item_MRP           Outlet_Establishment_Year         \
                            mean    median                      mean median
Outlet_Location_Type
Tier 1                140.870106  143.2641               1995.125628   1997
Tier 2                141.167196  143.2812               2004.330341   2004
Tier 3                140.935232  142.2483               1994.358507   1987

                     Item_Outlet_Sales
                                  mean     median
Outlet_Location_Type
Tier 1                     1876.909159  1487.3972
Tier 2                     2323.990559  2004.0580
Tier 3                     2279.627651  1812.3076

In [73]:
#Dictionary is passed
dataset.groupby(['Outlet_Location_Type','Outlet_Establishment_Year'],as_index = False).agg({'Outlet_Size':pd.Series.mode,'Item_Outlet_Sales':np.mean})

,Outlet_Location_Type,Outlet_Establishment_Year,Outlet_Size,Item_Outlet_Sales
0,Tier 1,1985,Small,340.329723
1,Tier 1,1997,Small,2277.844267
2,Tier 1,1999,Medium,2348.354635
3,Tier 2,2002,[],2192.384798
4,Tier 2,2004,Small,2438.841866
5,Tier 2,2007,[],2340.675263
6,Tier 3,1985,Medium,3694.038558
7,Tier 3,1987,High,2298.995256
8,Tier 3,1998,[],339.351662
9,Tier 3,2009,Medium,1995.498739

In [78]:
#tuple is passed
df.groupby(['Outlet_Type','Item_Type']).agg(mean_MRP=('Item_MRP',np.mean),mean_Sales=('Item_Outlet_Sales',np.mean))

KeyError: 'Outlet_Type'

# Transformation allows us to perform some computation on the groups as a whole and then return the combined DataFrame.
#This is done using the transform() function.

In [80]:
dataset['Item_Weight'] = dataset.groupby(['Item_Fat_Content','Item_Type'])['Item_Weight'].transform(lambda x: x.fillna(x.mean()))

In [81]:
dataset['Item_Weight']

0        9.300
1        5.920
2       17.500
3       19.200
4        8.930
         ...
8518     6.865
8519     8.380
8520    10.600
8521     7.210
8522    14.800
Name: Item_Weight, Length: 8523, dtype: float64

In [82]:
def filter_func(x):
    return x['Item_Weight'].std() < 3

In [84]:
df_filter = dataset.groupby('Item_Weight').filter(filter_func)
df_filter.shape

(8510, 12)

# Applying our own functions

#Pandas’ apply() function applies a function along an axis of the DataFrame. When using it with the GroupBy function, we can apply any function to the grouped result.

In [87]:
df_apply = dataset.groupby(['Outlet_Establishment_Year'])['Item_MRP'].apply(lambda x: x - x.mean())
df_apply

0       109.511501
1       -93.409434
2         1.320301
3        41.317406
4       -87.564582
           ...
8518     73.095818
8519    -32.793246
8520    -58.000081
8521    -38.545434
8522    -66.590387
Name: Item_MRP, Length: 8523, dtype: float64

# Pandas Series: apply() function

The apply() function is used to invoke a python function on values of Series.

# Syntax
Series.apply(self, func, convert_dtype=True, args=(), **kwds)

In [2]:
s = pd.Series([31, 27, 11],
              index=['Beijing', 'Los Angeles', 'Berlin'])
s

Beijing        31
Los Angeles    27
Berlin         11
dtype: int64

In [3]:
def square(x):
    return x ** 2

In [5]:
s.apply(square)

Beijing        961
Los Angeles    729
Berlin         121
dtype: int64

In [6]:
s.apply(lambda x : x**2)

Beijing        961
Los Angeles    729
Berlin         121
dtype: int64

In [7]:
def subtract_custom_value(x, custom_value):
    return x - custom_value

In [11]:
s.apply(subtract_custom_value, args=(1,))

Beijing        30
Los Angeles    26
Berlin         10
dtype: int64

Define a custom function that takes keyword arguments and pass these arguments to apply.

In [12]:
def add_custom_values(x, **kwargs):
    for month in kwargs:
        x += kwargs[month]
    return x

In [13]:
s.apply(add_custom_values, november=18, december=16, january=15)

Beijing        80
Los Angeles    76
Berlin         60
dtype: int64

Use a function from the Numpy library.#

In [17]:
s.apply(np.median)

Beijing        31.0
Los Angeles    27.0
Berlin         11.0
dtype: float64

# Aggregation in Pandas

# The agg() function uses one or more operations over the specified axis.

Syntax:
# Series.agg(self, func, axis=0 or index, *args, **kwargs)

In [18]:
s = pd.Series([2, 4, 6, 8])
s

0    2
1    4
2    6
3    8
dtype: int64

In [19]:
s.agg('min')

2

In [20]:
s.agg(['min', 'max'])

min    2
max    8
dtype: int64

# Call function on self producing a Series in Pandas 

The transform() function is used to call function on self producing a Series with transformed values and that has the same axis length as self.

Syntax:
# Series.transform(self, func, axis=0, *args, **kwargs)

In [21]:
df = pd.DataFrame({'P': range(4), 'Q': range(2, 6)})
df

   P  Q
0  0  2
1  1  3
2  2  4
3  3  5

In [22]:
df.transform(lambda x: x + 2)

   P  Q
0  2  4
1  3  5
2  4  6
3  5  7

In [23]:
s = pd.Series(range(4))
s

0    0
1    1
2    2
3    3
dtype: int64

In [24]:
s.transform([np.sqrt, np.exp])

       sqrt        exp
0  0.000000   1.000000
1  1.000000   2.718282
2  1.414214   7.389056
3  1.732051  20.085537

# Map values of Pandas Series

The map() function is used to map values of Series according to input correspondence.

Used for substituting each value in a Series with another value, that may be derived from a function, a dict or a Series.

Syntax:
# Series.map(self, arg, na_action=None)

In [25]:
s = pd.Series(['fox', 'cow', np.nan, 'dog'])
s

0    fox
1    cow
2    NaN
3    dog
dtype: object

In [26]:
s.map({'fox': 'cub', 'cow': 'calf'})

0     cub
1    calf
2     NaN
3     NaN
dtype: object

In [27]:
s.map('I am a {}'.format)

0    I am a fox
1    I am a cow
2    I am a nan
3    I am a dog
dtype: object

In [28]:
#To avoid applying the function to missing values (and keep them as NaN) na_action='ignore' can be used:
s.map('I am a {}'.format, na_action='ignore')

0    I am a fox
1    I am a cow
2           NaN
3    I am a dog
dtype: object

# Splitting the object in Pandas 

The groupby() function involves some combination of splitting the object, applying a function, and combining the results.

This can be used to group large amounts of data and compute operations on these groups

# Syntax:
Series.groupby(self, by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=False, observed=False, **kwargs)

In [29]:
df = pd.DataFrame({'Animal': ['Tiger', 'Tiger',
                              'Dog', 'Dog'],
                   'Max Speed': [270., 260., 36., 32.]})
df

  Animal  Max Speed
0  Tiger      270.0
1  Tiger      260.0
2    Dog       36.0
3    Dog       32.0

In [30]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Dog          34.0
Tiger       265.0

In [31]:
arrays = [['Tiger', 'Tiger', 'Dog', 'Dog'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [280., 250., 30., 20.]},
                  index=index)
df

                Max Speed
Animal Type
Tiger  Captive      280.0
       Wild         250.0
Dog    Captive       30.0
       Wild          20.0

In [32]:
df.groupby(level=0).mean()

        Max Speed
Animal
Dog          25.0
Tiger       265.0

In [33]:
df.groupby(level=1).mean()

         Max Speed
Type
Captive      155.0
Wild         135.0

# Rolling window calculations in Pandas

The rolling() function is used to provide rolling window calculations.

# Syntax:
Series.rolling(self, window, min_periods=None, center=False, win_type=None, on=None, axis=0, closed=None)

In [34]:
df = pd.DataFrame({'Q': [0, 2, 4, np.nan, 6]})
df

     Q
0  0.0
1  2.0
2  4.0
3  NaN
4  6.0

In [35]:
df.rolling(2, win_type='triang').sum()

     Q
0  NaN
1  1.0
2  3.0
3  NaN
4  NaN

In [36]:
df.rolling(1).sum()

     Q
0  0.0
1  2.0
2  4.0
3  NaN
4  6.0

In [37]:
df.rolling(2, min_periods=1).sum()

     Q
0  0.0
1  2.0
2  6.0
3  4.0
4  6.0

In [38]:
df = pd.DataFrame({'Q': [0, 2, 4, np.nan, 6]},
                  index = [pd.Timestamp('20190201 09:00:00'),
                           pd.Timestamp('20190201 09:00:02'),
                           pd.Timestamp('20190201 09:00:03'),
                           pd.Timestamp('20190201 09:00:05'),
                           pd.Timestamp('20190201 09:00:06')])
df

                       Q
2019-02-01 09:00:00  0.0
2019-02-01 09:00:02  2.0
2019-02-01 09:00:03  4.0
2019-02-01 09:00:05  NaN
2019-02-01 09:00:06  6.0

In [39]:
df.rolling('2s').sum()

                       Q
2019-02-01 09:00:00  0.0
2019-02-01 09:00:02  2.0
2019-02-01 09:00:03  6.0
2019-02-01 09:00:05  NaN
2019-02-01 09:00:06  6.0

# Expanding transformations in Pandas

The expanding() function is used to provide expanding transformations.

# Syntax:
Series.expanding(self, min_periods=1, center=False, axis=0)

In [44]:
df = pd.DataFrame({'Q': [0, 2, 4, np.nan, 6,8,9,10]})
df

      Q
0   0.0
1   2.0
2   4.0
3   NaN
4   6.0
5   8.0
6   9.0
7  10.0

In [45]:
a = df.expanding(1).sum()
a

      Q
0   0.0
1   2.0
2   6.0
3   6.0
4  12.0
5  20.0
6  29.0
7  39.0

# Exponential weighted functions in Pandas

The ewm() function is used to provide exponential weighted functions.

# Syntax:

Series.ewm(self, com=None, span=None, halflife=None, alpha=None, min_periods=0, adjust=True, ignore_na=False, axis=0)

In [46]:
df = pd.DataFrame({'Q': [0, 2, 4, np.nan, 6]})
df

     Q
0  0.0
1  2.0
2  4.0
3  NaN
4  6.0

In [48]:
df.ewm(com=0.3).mean()

          Q
0  0.000000
1  1.625000
2  3.474654
3  3.474654
4  5.838369

In [49]:
#Next : Computations / descriptive stats